<a href="https://colab.research.google.com/github/jessicarodrigues21/desafio_sql/blob/main/alunos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

conn = sqlite3.connect('desafio.db')
print('Conexão aberta!')

conn.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso Varchar(100))')

conn.commit()

In [ ]:
conn.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(1, "ANA", 20, "Computaçao")')
conn.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(2, "Caio", 18, "Administração")')
conn.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(3, "Maria", 22, "Contabilidade")')
conn.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(4, "Lucas", 19, "Matematica")')
conn.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(5, "Carol", 28, "Medicina")')

conn.commit()

In [26]:
dados = conn.execute('SELECT * FROM alunos')

for usuario in dados:
    print(usuario)

(1, 'ANA', 20, 'Computaçao')
(2, 'Caio', 18, 'Administração')
(3, 'Maria', 22, 'Contabilidade')
(4, 'Lucas', 19, 'Matematica')
(5, 'Carol', 28, 'Medicina')

In [27]:
dados = conn.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
for usuario in dados:
    print(usuario)

('Maria', 22)
('Carol', 28)

In [28]:
dados = conn.execute('SELECT * FROM alunos WHERE curso = "Engenharia" ORDER BY nome ASC')
for usuario in dados:
    print(usuario)

In [29]:
dados = conn.execute('SELECT COUNT(*) FROM alunos')
for usuario in dados:
    print(usuario)

(5,)

In [30]:
dados = conn.execute('UPDATE alunos SET idade = 21 WHERE id = 1')
for usuario in dados:
    print(usuario)

In [31]:
dados = conn.execute('DELETE FROM alunos WHERE id = 2')
for usuario in dados:
    print(usuario)